Revit 2027 API
ParameterTypeId.RebarSystemNumberOfLinesTopDirn1 Property
 "Top Major Number Of Lines"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemNumberOfLinesTopDirn1 { get; }
Public Shared ReadOnly Property RebarSystemNumberOfLinesTopDirn1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemNumberOfLinesTopDirn1 {
	ForgeTypeId^ get ();
}
static member RebarSystemNumberOfLinesTopDirn1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace